## Load `%sql` magic command

> If it is not installed, install it using:
```python
pip install ipython-sql
```

In [1]:
%load_ext sql

## Connect to a PostgreSQL database named **datacamp**

> For being able to connect to a database that is already created in your system you will have to instruct Python to detect its dialect. In simpler terms, you will have to tell Python that it is a PostgreSQL database. For that, you will need `psycopg2` which can be installed using:
```python
pip install psycopg2
```

In [5]:
%sql postgresql://postgres:postgres@localhost:5432/datacamp

'Connected: postgres@datacamp'

## Create a table named **datacamp_courses** with the following schema:
<img src = "Images/Schema.jpg">

In [26]:
%%sql
CREATE TABLE datacamp_courses(
 course_id SERIAL PRIMARY KEY,
 course_name VARCHAR (50) UNIQUE NOT NULL,
 course_instructor VARCHAR (100) NOT NULL,
 topic VARCHAR (20) NOT NULL
);

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/datacamp
Done.

[]

> Note the usage of `%sql` `%%sql` here. They are called [magic commands](https://ipython.readthedocs.io/en/stable/interactive/magics.html). For executing a single line of query you can use `%sql` but if you want to execute multiple queries in one go you will have to use `%%sql`.

## Insert some records to the newly created table
> Note that you are not explicitly specifying the course ids. It will be automatically handled by the RDBMS itself because you specified it to be a sequence. Specifying a sequence means the respective column's values will be generated automatically and incremented serially. More on PostgreSQL sequences here: http://www.postgresqltutorial.com/postgresql-serial/

In [27]:
%%sql
INSERT INTO datacamp_courses(course_name, course_instructor, topic) 
VALUES('Deep Learning in Python','Dan Becker','Python');
INSERT INTO datacamp_courses(course_name, course_instructor, topic) 
VALUES('Joining Data in PostgeSQL','Chester Ismay','SQL');

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/datacamp
1 rows affected.
1 rows affected.

[]

## View the table to make sure the insertions were done as expected

In [28]:
%%sql
select * from datacamp_courses;

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/datacamp
2 rows affected.

[(1, 'Deep Learning in Python', 'Dan Becker', 'Python'),
 (2, 'Joining Data in PostgeSQL', 'Chester Ismay', 'SQL')]

## Delete a record from the table 
> The general structure of a delete query in SQL looks like following:
```sql
DELETE FROM table
WHERE condition;
```
You are going to delete the record where course_name = "Deep Learning in Python" and then verify if the record is deleted.

In [30]:
%%sql
delete from datacamp_courses where course_name = 'Deep Learning in Python';

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/datacamp
1 rows affected.

[]

In [31]:
%%sql
select * from datacamp_courses;

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/datacamp
1 rows affected.

[(2, 'Joining Data in PostgeSQL', 'Chester Ismay', 'SQL')]

## Update a record in the table
> The general structure of an update query in SQL looks like following:
```sql
UPDATE table
SET column1 = value1,
    column2 = value2 ,...
WHERE
 condition;
```
You are going to update the record where course_instructor = "Chester Ismay" and set the course_name to "Joining Data in SQL". You will then verify if the record is updated.

In [33]:
%sql update datacamp_courses set course_name = 'Joining Data in SQL' where course_instructor = 'Chester Ismay';

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/datacamp
1 rows affected.

[]

Note that you used `%sql` command here. Also pay close attention when you are dealing with strings in SQL. Unlike traditional programming languages the strings values need to be wrapped using single quotes.

## Truncate a table

In [22]:
%%sql
truncate table datacamp_courses;

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/datacamp
Done.

[]

## Reset the sequence of the primary key

In [21]:
%%sql
ALTER SEQUENCE datacamp_courses_course_id_seq RESTART WITH 1;

   postgresql://postgres:***@localhost:5432
 * postgresql://postgres:***@localhost:5432/datacamp
Done.

[]

## Getting started with SQLAlchemy and combining it with SQL magic commands:

In [2]:
import pandas as pd
from sqlalchemy import create_engine

In [3]:
engine = create_engine('postgresql://postgres:postgres@localhost:5432/datacamp')
df = pd.read_sql('select * from student', engine)
df.head()

  student_id  student_name student_year
0          1    Zaid Alam           2nd
1          2  Mamta kumari          2nd
2          3    Aisha Anis          2nd
3          4     Faiz Alam          2nd
4          5  Aniket Kumar          2nd

In [6]:
df_new = %sql select * from student
df_new.DataFrame().head()

 * postgresql://postgres:***@localhost:5432/datacamp
86 rows affected.

  student_id  student_name student_year
0          1    Zaid Alam           2nd
1          2  Mamta kumari          2nd
2          3    Aisha Anis          2nd
3          4     Faiz Alam          2nd
4          5  Aniket Kumar          2nd